_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_ПереходНаСмета3_0Смета2_3.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>СМ_ПереходНаСмета3_0Смета2_3</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантРаботыМастера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/СМ_ПереходНаСмета3_0Смета2_3/Forms/Форма/Ext/Form/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура КомандаДалее(Команда)
	Если Элементы.ПанельОсновная.ТекущаяСтраница  = Элементы.ПанельОсновная.ПодчиненныеЭлементы.СтраницаЗагрузкиИзСметы2_3 Тогда
		АдресФайла = "";
		Если Объект.РежимОбработки = "1" Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьЗагрузкуИзФормыЗавершение", ЭтотОбъект);
			НачатьПомещениеФайла(ОписаниеОповещения, АдресФайла,Нстр("ru = 'Файл обмена'"),, УникальныйИдентификатор);

		Иначе
		    ВыполнитьЗагрузкуИзФормыЗавершение(Истина, АдресФайла, "", Неопределено);
		КонецЕсли;
	Иначе
		Если Объект.ВариантРаботыМастера = "1" Тогда
			Элементы.ПанельОсновная.ТекущаяСтраница  = Элементы.ПанельОсновная.ПодчиненныеЭлементы.СтраницаЗагрузкиИзСметы2_3;
			Элементы.КомандаДалее3.Заголовок = "Загрузить >";
			Элементы.КомандаГотово6.Заголовок = "Готово!";
			Объект.РежимОбработки = "1";
			Элементы.ИмяФайлаОбмена.Видимость =Ложь;
		ИначеЕсли Объект.ВариантРаботыМастера = "1" Тогда
			
		ИначеЕсли Объект.ВариантРаботыМастера = "3" Тогда
			Закрыть();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗагрузкуИзФормыЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
		
		Состояние(НСтр("ru = 'Выполняется загрузка данных. Пожалуйста, подождите...'"));
		ВыполнитьЗагрузкуНаСервере(Адрес, ВыбранноеИмяФайла);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗагрузкуНаСервере(АдресФайла, ИмяФайлаДляРасширения)
	
	ИмяЗагружаемогоФайла = ИмяФайлаНаСервереИлиКлиенте(Объект.ИмяФайлаОбмена ,АдресФайла, ИмяФайлаДляРасширения);
	
	Если ИмяЗагружаемогоФайла = Неопределено Тогда
		
		Возврат;
		
	Иначе
		
		Объект.ИмяФайлаОбмена = ИмяЗагружаемогоФайла;
		
	КонецЕсли;
	
	ОбъектДляСервера = Обработки.УниверсальныйОбменДаннымиXML.Создать();
	ЗаполнитьЗначенияСвойств(ОбъектДляСервера, Объект);
	ОбъектДляСервера.РежимОбмена = "Загрузка";
	ОбъектДляСервера.ВыполнитьЗагрузку();
	
	Попытка
		
		Если Не ПустаяСтрока(АдресФайла) Тогда
			УдалитьФайлы(ИмяЗагружаемогоФайла);
		КонецЕсли;
		
	Исключение
		Событие = НСтр("ru = 'Исключение Переход 2.3-3.0'");
		СМ_СметаЗагрузкаВызовСервера.ЗаписатьВЖурналаРегистрации(Событие);

	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ИмяФайлаНаСервереИлиКлиенте(ИмяРеквизита ,Знач АдресФайла = "", Знач ИмяФайлаДляРасширения = ".xml",
									СоздатьНовый = Ложь, ПроверятьСуществование = Истина)
	
	ИмяФайла = Неопределено;
	
	Если Объект.РежимОбработки = "1" Тогда
		
		Если СоздатьНовый Тогда
			
			Расширение = ? (Объект.АрхивироватьФайл, ".zip", ".xml");
			
			ИмяФайла = ПолучитьИмяВременногоФайла(Расширение);
			
			Файл = Новый Файл(ИмяФайла);
			
		Иначе
			
			Расширение = ".xml";
			ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайла);
			АдресНаСервере = ПолучитьИмяВременногоФайла(Расширение);
			ДвоичныеДанные.Записать(АдресНаСервере);
			ИмяФайла = АдресНаСервере;
			
		КонецЕсли;
		
	Иначе
		
		ФайлНаСервере = Новый Файл(ИмяРеквизита);
		
		Если Не ФайлНаСервере.Существует() И ПроверятьСуществование Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Указанный файл не существует.'"));
			
		Иначе
			
			ИмяФайла = ИмяРеквизита;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ИмяФайла;
	
КонецФункции

&НаКлиенте
Процедура ИмяФайлаОбменаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыборФайла(Элемент, Объект.ИмяФайлаОбмена);
КонецПроцедуры

// Открывает диалог выбора файла.
//
// Параметры:
//  Элемент                - Элемент управления, для которого выбираем файл
//  ПроверятьСуществование - Если Истина, то выбор отменяется если файл не существует.
// 
&НаКлиенте
Процедура ВыборФайла(Элемент, ИмяСвойства)
	
	ДиалогВыбораФайла 								= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр 						= "Файл данных (*.xml)|*.xml";
	ДиалогВыбораФайла.Расширение 					= "xml";
	ДиалогВыбораФайла.Заголовок 					= НСтр("ru = 'Выберите файл'");
	ДиалогВыбораФайла.ПредварительныйПросмотр 		= Ложь;
	ДиалогВыбораФайла.ИндексФильтра 				= 0;
	ДиалогВыбораФайла.ПолноеИмяФайла 				= Элемент.ТекстРедактирования;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла 	= Истина;
	// Синхронный вызов
	//Если ДиалогВыбораФайла.Выбрать() Тогда
	//	ИмяСвойства = ДиалогВыбораФайла.ПолноеИмяФайла;
	//КонецЕсли;
	
	// Замена на асинхронный вызов
	ОповещениеВыбора = Новый ОписаниеОповещения("ВыполнитьПослеВыбораФайла", ЭтотОбъект);
	ДиалогВыбораФайла.Показать(ОповещениеВыбора);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораФайла(ВыбранныеФайлы,ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		Для Каждого ТекЭлемент Из ВыбранныеФайлы Цикл
			ИмяСвойства = ТекЭлемент;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОбработкиПриИзменении(Элемент)
	Элементы.ИмяФайлаОбмена.Видимость =?(Объект.РежимОбработки = "1",Ложь,Истина);;
КонецПроцедуры

&НаКлиенте
Процедура КомандаГотово(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти
